typedef struct {
	int xPos, yPos, width, height;
}Rect, * pRect;

//캐릭터가 처음에 올 위치
typedef struct {
	int xOrg, yOrg;
}Org, *pOrg;

//캐릭터가 가로,세로로 움직일 방향
typedef struct {
	int xDir;		//xDir : 0이면 왼쪽, 1이면 오른쪽
	int yDir;		//yDir : 0이면 위쪽, 1이면 아래쪽
}Dir, pDir;

//Org 기준으로 가로,세로로 얼마나 멀리 떨어져 있는지 나타내는 구조체
typedef struct {
	int dx,dy;
}DS, pDS;

typedef struct {
	const Rect* images;		//사용할 이미지 집합을 가리키는 주소 변수
	int num_img;			//이미지의 개수
	int cur_img;			//현재 화면에 출력하고 있는 이미지
	Org org;
	Dir dir;
	DS ds;
}Bird,*pBird;

const Rect red_bird[] = {
		{ 10,14,102,97 },
		{ 116,14,100,97 },
		{ 10,118,102,97 },
		{ 116,118,100,97 },
		{ 10,226,102,93 },
};

const Rect green_bird[] = {
	 {217,23,100,64},
	 {323,23,102,64},
	 {429,32,105,64},
	 {217,121,107,63},
	 {216,211,103,66},
	 {217,292,87,94},
	 {110,230,103,65},
};

const Rect bomb_bird[] = {
	 {323,116,71,83},
	 {397,108,69,90},
	 {468,109,67,88},
	 {326,202,68,89},
	 {326,295,68,88},
};

const Rect yellow_bird[] = {
	 {14,320,63,56},
	 {120,311,64,56},
	 {403,199,63,56},
	 {395,255,70,56},
	 {405,313,60,57},
};

const Rect red_mini_bird[] = {
	 {538,14,50,47},
	 {540,108,50,47},
	 {469,201,48,48},
	 {519,200,52,47},
	 {467,253,51,45},
	 {521,251,50,48},
};

const Rect bluesky_bird[] = {
	 {538,62,33,34},
	 {538,157,34,33},
	 {466,301,35,34},
	 {503,303,35,31},
	 {467,337,34,33},
	 {504,335,33,34},
};